src/Reports/СверкаТОКанбанУД/СверкаТОКанбанУД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СверкаТОКанбанУД</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/НормыРасходов/НормыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыРасходов</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.Материалы</owners>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовНормРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корневой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/СверкаТОКанбанУД/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПолучитьТаблицуТО(ЭтапСпецификации,Количество)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	НормыРасходов.Элемент,
	|	НормыРасходов.ВидЭлемента,
	|	НормыРасходовСрезПоследних.Норма
	|ИЗ
	|	РегистрСведений.НормыРасходов.СрезПоследних(&НаДату, ) КАК НормыРасходовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыРасходов КАК НормыРасходов
	|		ПО НормыРасходовСрезПоследних.НормаРасходов = НормыРасходов.Ссылка
	|ГДЕ
	|	НормыРасходов.ПометкаУдаления = ЛОЖЬ
	|	И НормыРасходов.Владелец = &Владелец
	|	И (ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.ТехОперации)
	|			ИЛИ ТИПЗНАЧЕНИЯ(НормыРасходов.Элемент) = ТИП(Справочник.Номенклатура))
	|	И НормыРасходовСрезПоследних.Норма > 0";
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
Запрос.УстановитьПараметр("Владелец", ЭтапСпецификации);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Набор Тогда
		ПолучитьТаблицуТО(ВыборкаДетальныеЗаписи.Элемент,ПолучитьБазовоеКоличество(ВыборкаДетальныеЗаписи.Норма,ВыборкаДетальныеЗаписи.Элемент.ОсновнаяЕдиницаИзмерения)*Количество);
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.ТехОперация Тогда
		ТЧ = ТаблицаТО.Добавить();
		ТЧ.ТехОперация = ВыборкаДетальныеЗаписи.Элемент;
			Если ВыборкаДетальныеЗаписи.Элемент.Оборудование.Количество() > 0 Тогда
			ТЧ.Количество = ВыборкаДетальныеЗаписи.Норма*Количество;	
			КонецЕсли;
		ИначеЕсли (ВыборкаДетальныеЗаписи.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Деталь)или
				  (ВыборкаДетальныеЗаписи.ВидЭлемента = Перечисления.ВидыЭлементовНормРасходов.Узел) Тогда	
			Если Не ВыборкаДетальныеЗаписи.Элемент.Канбан.Пустая() Тогда	
			Продолжить; 
			КонецЕсли; 
		ПолучитьТаблицуТО(ВыборкаДетальныеЗаписи.Элемент,ПолучитьБазовоеКоличество(ВыборкаДетальныеЗаписи.Норма,ВыборкаДетальныеЗаписи.Элемент.ОсновнаяЕдиницаИзмерения)*Количество);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
Запрос = Новый Запрос;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблИзделие = Макет.ПолучитьОбласть("Изделие");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблТО = Макет.ПолучитьОбласть("ТО");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапка);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииКанбан.ДокументОснование КАК ПЗ,
	|	ВыпускПродукцииКанбан.Дата,
	|	ВыпускПродукцииКанбан.Количество,
	|	ВыпускПродукцииКанбан.Изделие КАК Изделие
	|ИЗ
	|	Документ.ВыпускПродукцииКанбан КАК ВыпускПродукцииКанбан
	|ГДЕ
	|	ВыпускПродукцииКанбан.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииКанбан.ДокументОснование.Линейка В ИЕРАРХИИ(&СписокЛинеек)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыпускПродукцииКанбан.Изделие.Наименование
	|ИТОГИ ПО
	|	Изделие";
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);  
РезультатЗапроса = Запрос.Выполнить();
ВыборкаИзделия = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИзделия.Следующий() Цикл
	ТаблицаТО.Очистить();
	ПолучитьТаблицуТО(ВыборкаИзделия.Изделие,1);
	ТЗЭталон = ТаблицаТО.Выгрузить();
	ТЗЭталон.Свернуть("ТехОперация","Количество");
	флВыведено = Ложь;
	ВыборкаДетальныхЗаписей = ВыборкаИзделия.Выбрать();
		Пока ВыборкаДетальныхЗаписей.Следующий() Цикл
		ТЗ = ВыборкаДетальныхЗаписей.ПЗ.Оборудование.Выгрузить();
		ТЗ.Свернуть("ТехОперация","Количество");
		флСовпадают = Истина;
			Для каждого ТЧ_ТО Из ТЗ Цикл
			Выборка = ТЗЭталон.Найти(ТЧ_ТО.ТехОперация,"ТехОперация");
				Если Выборка = Неопределено Тогда
				флСовпадают = Ложь;
				Прервать;
				Иначе
					Если ТЧ_ТО.Количество <> Выборка.Количество Тогда
					флСовпадают = Ложь;
					Прервать;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
				Если флСовпадают Тогда
					Для каждого ТЧ_ТО_Эталон Из ТЗЭталон Цикл
					Выборка	= ТЗ.Найти(ТЧ_ТО_Эталон.ТехОперация,"ТехОперация");
						Если Выборка = Неопределено Тогда	
						флСовпадают = Ложь;
						Прервать;
						Иначе
							Если ТЧ_ТО_Эталон.Количество <> Выборка.Количество Тогда
							флСовпадают = Ложь;
							Прервать;
							КонецЕсли; 
						КонецЕсли; 
					КонецЦикла;
				КонецЕсли;  	
					Если Не флСовпадают Тогда
						Если Не флВыведено Тогда
						ОблИзделие.Параметры.Наименование = СокрЛП(ВыборкаИзделия.Изделие.Наименование);
						ОблИзделие.Параметры.Номенклатура = ВыборкаИзделия.Изделие;
						ТабДок.Вывести(ОблИзделие);
							Для Каждого ТЧ Из ТаблицаТО Цикл	
							ОблТО.Параметры.НаименованиеТО = СокрЛП(ТЧ.ТехОперация.Наименование);
							ОблТО.Параметры.ТО = ТЧ.ТехОперация;
							ОблТО.Параметры.Количество = ТЧ.Количество;
							ТабДок.Вывести(ОблТО);		
							КонецЦикла; 
						ТабДок.НачатьГруппуСтрок("Изделие",Истина);
						флВыведено = Истина;
						КонецЕсли; 
					ОблПЗ.Параметры.ПЗ = ВыборкаДетальныхЗаписей.ПЗ;
					ТабДок.Вывести(ОблПЗ);					
					КонецЕсли;
		КонецЦикла;
			Если флВыведено Тогда
			ТабДок.ЗакончитьГруппуСтрок();
			КонецЕсли;
	КонецЦикла;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2; 
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры
